2021.06.22.org
#+OPTIONS: ^:nil
#+OPTIONS: html-postamble:nil
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+OPTIONS: author:nil
#+HTML_HEAD: <style type="text/css">#table-of-contents h2 { display: none } .title { display: none } .authorname { text-align: right }</style>
#+HTML_HEAD: <style type="text/css">.outline-2 {border-top: 1px solid black;}</style>
#+TITLE: OCaml Weekly News
[[https://alan.petitepomme.net/cwn/2021.06.15.html][Previous Week]] [[https://alan.petitepomme.net/cwn/index.html][Up]] [[https://alan.petitepomme.net/cwn/2021.06.29.html][Next Week]]

Hello

Here is the latest OCaml Weekly News, for the week of June 15 to 22, 2021.

#+TOC: headlines 1


* First releases of dirsp-exchange: auditable variant of Signal Protocol and ProScript-to-OCaml translator
:PROPERTIES:
:CUSTOM_ID: 1
:END:
Archive: https://discuss.ocaml.org/t/ann-first-releases-of-dirsp-exchange-auditable-variant-of-signal-protocol-and-proscript-to-ocaml-translator/8008/1

** jbeckford announced


I'm pleased to announce the first release of
[[https://github.com/diskuv/dirsp-exchange#readme][dirsp-exchange]], available today from the Opam
repositories.

The intent of the *[dirsp]* libraries is to provide software engineers with auditable source code
that has some level of safety assurance (typically proofs) from security researchers.

The first libraries are:

- dirsp-exchange-kbb2017 0.1.0 - The KBB2017 protocol for securing a two-party conversation. Similar to Signal Protocol v3 and Olm Cryptographic Ratchet.
- dirsp-ps2ocaml 0.1.0 - A ProScript to OCaml translator. ProScript is an executable subset of JavaScript that can be formally verified.

and a couple more supporting libraries.

~dirsp-exchange-kbb2017~ has a build process that generates its own OCaml code using ~dirsp-ps2ocaml~
on formally verified ProScript source code.

The canonical example for ~dirsp-exchange-kbb2017~ is:

#+begin_src ocaml
module P       = Dirsp_proscript_mirage.Make()
module ED25519 = P.Crypto.ED25519
module K       = Dirsp_exchange_kbb2017.Make(P)
module U       = K.UTIL

(* Alice sends a message to Bob *)
let aliceSessionWithBob = T.newSession (* ... supply some keys you create with ED25519 and U ... *) ;;
let aliceToBobSendOutput = T.send
  aliceIdentityKey
  aliceSessionWithBob
  (P.of_string "Hi Bob!")

(* Now you can send the output "aliceToBobSendOutput" from Alice to Bob.
   Let's switch to Bob's computer. He gets notified of a new message using a notification library of
your choosing, and then does ...  *)

let bobSessionWithAlice = T.newSession (* ... supply some keys ... *);;
let bobFromAliceReceiveOutput = T.recv
  bobIdentityKey
  bobSignedPreKey
  bobSessionWithAlice
  theEncryptedMessageBobReceivedFromAlice
assert (bobFromAliceReceiveOutput.output.valid)
Format.printf "Bob just received a new message: %s\n"
  (bobFromAliceReceiveOutput.plaintext |> P.to_bytes |> Bytes.to_string)
#+end_src

These are early releases, especially ~dirsp-ps2ocaml~.

Online docs are at https://diskuv.github.io/dirsp-exchange

Feedback, contributions and downloads are very welcome!
      



* Job offer: 3 year research engineer in static analysis of OCaml programs at Inria Rennes
:PROPERTIES:
:CUSTOM_ID: 2
:END:
Archive: https://discuss.ocaml.org/t/job-offer-3-year-research-engineer-in-static-analysis-of-ocaml-programs-at-inria-rennes/8012/1

** Benoit Montagu announced


as part of a project between Inria and Nomadic Labs, we are offering a 3 year research engineer
position, to work on static analysis for OCaml programs.
The position will start in October in the Celtique Inria research team, in the vibrant city of Rennes,
France.
If you are a talented OCaml programmer, if you are interested in static analysis, or if you simply want
to know more about this project, please contact me!

The detailed job description is here: https://jobs.inria.fr/public/classic/fr/offres/2021-03821

Please feel free to transfer this announce to people that you think could be interested.
      



* IRC channels available on libera.chat
:PROPERTIES:
:CUSTOM_ID: 3
:END:
Archive: https://sympa.inria.fr/sympa/arc/caml-list/2021-06/msg00014.html

** Deep in this thread, Romain Calascibetta announced


Just to let you know that I spent a time to re-implement the IRC protocol
in OCaml and to deploy a simple MirageOS as
a logger to save discussions into a Git repository. The bot is currently
deployed, the explanation is available here:
https://github.com/dinosaure/cri/tree/master/unikernel
And used for #mirage@irc.libera.chat

It's a nice example about MirageOS/unikernel and I may deploy one to save
#ocaml@irc.libera.chat as whitequark already does with her bot.
      



* Set up OCaml 2.0.0-beta
:PROPERTIES:
:CUSTOM_ID: 4
:END:
Archive: https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0-beta/8016/1

** Sora Morimoto announced


Hopefully, this will be the last release before stable 2.0.0. This release allows you to add multiple
custom repositories, which enables testing with multicore and beta repository.

#+begin_src yml
- name: Use Multicore OCaml
  uses: ocaml/setup-ocaml@v2
  with:
    ocaml-compiler: ocaml-variants.4.12.0+domains+effects
    opam-repositories: |
      multicore: https://github.com/ocaml-multicore/multicore-opam.git
      default: https://github.com/ocaml/opam-repository.git
#+end_src
      



