2021.06.22.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-06-22 Tue 11:03 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="https://alan.petitepomme.net/cwn/2021.06.15.html">Previous Week</a> <a href="https://alan.petitepomme.net/cwn/index.html">Up</a> <a href="https://alan.petitepomme.net/cwn/2021.06.29.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of June 15 to 22, 2021.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">First releases of dirsp-exchange: auditable variant of Signal Protocol and ProScript-to-OCaml translator</a></li>
<li><a href="#2">Job offer: 3 year research engineer in static analysis of OCaml programs at Inria Rennes</a></li>
<li><a href="#3">IRC channels available on libera.chat</a></li>
<li><a href="#4">Set up OCaml 2.0.0-beta</a></li>
<li><a href="#5">First release of Jsonxt - a set of JSON parsers and writers</a></li>
<li><a href="#6">mula 0.1.0, ML's radishal Universal Levenshtein Automata library</a></li>
<li><a href="#7">New release of mlcuddidl, the OCaml interface to the CUDD BDD library</a></li>
<li><a href="#8">first release of orf: OCaml Random Forests</a></li>
<li><a href="#org4ca673b">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-1" class="outline-2">
<h2 id="1">First releases of dirsp-exchange: auditable variant of Signal Protocol and ProScript-to-OCaml translator</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-first-releases-of-dirsp-exchange-auditable-variant-of-signal-protocol-and-proscript-to-ocaml-translator/8008/1">https://discuss.ocaml.org/t/ann-first-releases-of-dirsp-exchange-auditable-variant-of-signal-protocol-and-proscript-to-ocaml-translator/8008/1</a>
</p>
</div>

<div id="outline-container-orgaa08ade" class="outline-3">
<h3 id="orgaa08ade">jbeckford announced</h3>
<div class="outline-text-3" id="text-orgaa08ade">
<p>
I'm pleased to announce the first release of
<a href="https://github.com/diskuv/dirsp-exchange#readme">dirsp-exchange</a>, available today from the Opam
repositories.
</p>

<p>
The intent of the <b>[dirsp]</b> libraries is to provide software engineers with auditable source code
that has some level of safety assurance (typically proofs) from security researchers.
</p>

<p>
The first libraries are:
</p>

<ul class="org-ul">
<li>dirsp-exchange-kbb2017 0.1.0 - The KBB2017 protocol for securing a two-party conversation. Similar to Signal Protocol v3 and Olm Cryptographic Ratchet.</li>
<li>dirsp-ps2ocaml 0.1.0 - A ProScript to OCaml translator. ProScript is an executable subset of JavaScript that can be formally verified.</li>
</ul>

<p>
and a couple more supporting libraries.
</p>

<p>
<code>dirsp-exchange-kbb2017</code> has a build process that generates its own OCaml code using <code>dirsp-ps2ocaml</code>
on formally verified ProScript source code.
</p>

<p>
The canonical example for <code>dirsp-exchange-kbb2017</code> is:
</p>

<div class="org-src-container">
<pre class="src src-ocaml"><span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">P</span>       = <span style="color: #228b22;">Dirsp_proscript_mirage.Make</span>()
<span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">ED25519</span> = <span style="color: #228b22;">P.Crypto.ED25519</span>
<span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">K</span>       = <span style="color: #228b22;">Dirsp_exchange_kbb2017.Make(P)</span>
<span style="color: #000000; font-weight: bold;">module</span> <span style="color: #228b22;">U</span>       = <span style="color: #228b22;">K.UTIL</span>

<span style="color: #b22222;">(* </span><span style="color: #b22222;">Alice sends a message to Bob </span><span style="color: #b22222;">*)</span>
<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">aliceSessionWithBob</span> = <span style="color: #228b22;">T.</span>newSession <span style="color: #b22222;">(* </span><span style="color: #b22222;">... supply some keys you create with ED25519 and U ... </span><span style="color: #b22222;">*)</span> <span style="color: #ff4500;">;;</span>
<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">aliceToBobSendOutput</span> = <span style="color: #228b22;">T.</span>send
  aliceIdentityKey
  aliceSessionWithBob
  (<span style="color: #228b22;">P.</span>of_string <span style="color: #8b2252;">"Hi Bob!"</span>)

<span style="color: #b22222;">(* </span><span style="color: #b22222;">Now you can send the output "aliceToBobSendOutput" from Alice to Bob.</span>
<span style="color: #b22222;">   Let's switch to Bob's computer. He gets notified of a new message using a notification library of</span>
<span style="color: #b22222;">your choosing, and then does ...  </span><span style="color: #b22222;">*)</span>

<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">bobSessionWithAlice</span> = <span style="color: #228b22;">T.</span>newSession <span style="color: #b22222;">(* </span><span style="color: #b22222;">... supply some keys ... </span><span style="color: #b22222;">*)</span><span style="color: #ff4500;">;;</span>
<span style="color: #000000; font-weight: bold;">let</span> <span style="color: #a0522d;">bobFromAliceReceiveOutput</span> = <span style="color: #228b22;">T.</span>recv
  bobIdentityKey
  bobSignedPreKey
  bobSessionWithAlice
  theEncryptedMessageBobReceivedFromAlice
<span style="color: #a020f0;">assert</span> (bobFromAliceReceiveOutput.output.valid)
<span style="color: #228b22;">Format.</span>printf <span style="color: #8b2252;">"Bob just received a new message: %s\n"</span>
  (bobFromAliceReceiveOutput.plaintext <span style="color: #a52a2a;">|&gt;</span> <span style="color: #228b22;">P.</span>to_bytes <span style="color: #a52a2a;">|&gt;</span> <span style="color: #228b22;">Bytes.</span>to_string)
</pre>
</div>

<p>
These are early releases, especially <code>dirsp-ps2ocaml</code>.
</p>

<p>
Online docs are at <a href="https://diskuv.github.io/dirsp-exchange">https://diskuv.github.io/dirsp-exchange</a>
</p>

<p>
Feedback, contributions and downloads are very welcome!
</p>
</div>
</div>
</div>




<div id="outline-container-2" class="outline-2">
<h2 id="2">Job offer: 3 year research engineer in static analysis of OCaml programs at Inria Rennes</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/job-offer-3-year-research-engineer-in-static-analysis-of-ocaml-programs-at-inria-rennes/8012/1">https://discuss.ocaml.org/t/job-offer-3-year-research-engineer-in-static-analysis-of-ocaml-programs-at-inria-rennes/8012/1</a>
</p>
</div>

<div id="outline-container-orgc5218a1" class="outline-3">
<h3 id="orgc5218a1">Benoit Montagu announced</h3>
<div class="outline-text-3" id="text-orgc5218a1">
<p>
as part of a project between Inria and Nomadic Labs, we are offering a 3 year research engineer
position, to work on static analysis for OCaml programs.
The position will start in October in the Celtique Inria research team, in the vibrant city of Rennes,
France.
If you are a talented OCaml programmer, if you are interested in static analysis, or if you simply want
to know more about this project, please contact me!
</p>

<p>
The detailed job description is here: <a href="https://jobs.inria.fr/public/classic/fr/offres/2021-03821">https://jobs.inria.fr/public/classic/fr/offres/2021-03821</a>
</p>

<p>
Please feel free to transfer this announce to people that you think could be interested.
</p>
</div>
</div>
</div>




<div id="outline-container-3" class="outline-2">
<h2 id="3">IRC channels available on libera.chat</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://sympa.inria.fr/sympa/arc/caml-list/2021-06/msg00014.html">https://sympa.inria.fr/sympa/arc/caml-list/2021-06/msg00014.html</a>
</p>
</div>

<div id="outline-container-org87424dc" class="outline-3">
<h3 id="org87424dc">Deep in this thread, Romain Calascibetta announced</h3>
<div class="outline-text-3" id="text-org87424dc">
<p>
Just to let you know that I spent a time to re-implement the IRC protocol
in OCaml and to deploy a simple MirageOS as
a logger to save discussions into a Git repository. The bot is currently
deployed, the explanation is available here:
<a href="https://github.com/dinosaure/cri/tree/master/unikernel">https://github.com/dinosaure/cri/tree/master/unikernel</a>
And used for #mirage@irc.libera.chat
</p>

<p>
It's a nice example about MirageOS/unikernel and I may deploy one to save
#ocaml@irc.libera.chat as whitequark already does with her bot.
</p>
</div>
</div>
</div>




<div id="outline-container-4" class="outline-2">
<h2 id="4">Set up OCaml 2.0.0-beta</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0-beta/8016/1">https://discuss.ocaml.org/t/ann-set-up-ocaml-2-0-0-beta/8016/1</a>
</p>
</div>

<div id="outline-container-org36efd04" class="outline-3">
<h3 id="org36efd04">Sora Morimoto announced</h3>
<div class="outline-text-3" id="text-org36efd04">
<p>
Hopefully, this will be the last release before stable 2.0.0. This release allows you to add multiple
custom repositories, which enables testing with multicore and beta repository.
</p>

<div class="org-src-container">
<pre class="src src-yml">- name: Use Multicore OCaml
  uses: ocaml/setup-ocaml@v2
  with:
    ocaml-compiler: ocaml-variants.4.12.0+domains+effects
    opam-repositories: |
      multicore: https://github.com/ocaml-multicore/multicore-opam.git
      default: https://github.com/ocaml/opam-repository.git
</pre>
</div>
</div>
</div>
</div>
