2021.06.22.html




<div id="outline-container-5" class="outline-2">
<h2 id="5">First release of Jsonxt - a set of JSON parsers and writers</h2>
<div class="outline-text-2" id="text-5">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-first-release-of-jsonxt-a-set-of-json-parsers-and-writers/8018/1">https://discuss.ocaml.org/t/ann-first-release-of-jsonxt-a-set-of-json-parsers-and-writers/8018/1</a>
</p>
</div>

<div id="outline-container-orgfe3f2a3" class="outline-3">
<h3 id="orgfe3f2a3">Stephen Bleazard announced</h3>
<div class="outline-text-3" id="text-orgfe3f2a3">
<p>
Jsonxt provides a number of JSON parsers and writers for RFC 8259 compliant JSON as well as
non-standard extensions supported by Yojson.  Features include
</p>
<ul class="org-ul">
<li>RFC 8259 compliant when in strict and basic mode</li>
<li>Performance focused especially for files and strings</li>
<li>Support for standard and extended JSON tree types:
<ul class="org-ul">
<li>Strict follows a strict interpretation of RFC 8259 with all numbers represented as floats.</li>
<li>Basic extends the strict type to include convenience types while maintaining RFC compliance.  This is compatible with Yojson's Basic type</li>
<li>Extended adds additional non-standard types including tuples and variants and is not RFC compliant. This is compatible with Yojson's Safe type</li>
</ul></li>
<li>A number of different parsers including
<ul class="org-ul">
<li>A standard JSON tree parser for various sources including string, file and channel</li>
<li>A Stream parser that returns a stream of raw JSON tokens.</li>
<li>A monad based parser compatible with async</li>
</ul></li>
<li>Writers including
<ul class="org-ul">
<li>File and string writers</li>
<li>A monad based writer that is compatible with async</li>
<li>A stream writer that converts a stream of JSON tokens</li>
</ul></li>
<li>Support for streaming JSON via the <a href="https://ocaml.org/api/Stream.html">Stream</a> module</li>
<li>Standard interfaces including Yojson compatibility</li>
<li>Support for <code>ppx_deriving_yojson</code> and <code>ppx_yojson_conv</code> via Yojson compatibility</li>
</ul>

<p>
The package is available via opam, with documentation on
<a href="https://stevebleazard.github.io/ocaml-jsonxt/jsonxt/index.html">github.io</a>.  The source can be found
at <a href="https://github.com/stevebleazard/ocaml-jsonxt">github/jsonxt</a>
</p>
</div>
</div>
</div>




<div id="outline-container-6" class="outline-2">
<h2 id="6">mula 0.1.0, ML's radishal Universal Levenshtein Automata library</h2>
<div class="outline-text-2" id="text-6">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-mula-0-1-0-mls-radishal-universal-levenshtein-automata-library/8021/1">https://discuss.ocaml.org/t/ann-mula-0-1-0-mls-radishal-universal-levenshtein-automata-library/8021/1</a>
</p>
</div>

<div id="outline-container-orgf926fb7" class="outline-3">
<h3 id="orgf926fb7">Ifaz Kabir announced</h3>
<div class="outline-text-3" id="text-orgf926fb7">
<p>
I'm happy to announce the release of my library <code>mula</code>. The package uses Universal Levenshtein Automata
(ULA) to not only check if a word is within a certain edit distance of another, but to also output what
the edit distance is! It uses the automata themselves to calculate edit distances. A fun use case for
this is that we can feed a set of words to the automaton and immediately rank the words by their edit
distance.
</p>

<p>
<code>Mula</code> supports both the standard Levenshtein edit distance as well as the Demarau-Levenshtein distance
which counts transpositions of two adjacent characters as a single edit. I also support getting live
error counts, so you can feed part of a string into an automaton, and get the minimum number of errors
that have occurred so far.
</p>

<p>
I currently have matching working using non-deterministic ULA, but I have partially started the work
toward the deterministic versions. It should be possible to pre-compute the DFAs for up to edit
distance 3 and pack it with the library, never needing to be recomputed because the Universal Automata
are independent of the input strings. But the non-deterministic automata support very large edit
distances: (Sys.int_size - 1)/2, so they have value on their own.
</p>

<p>
This library came about from a desire to add a "did you mean" feature to a toy compiler, but not
wanting to write the kind of dynamic programming code that you can find in the OCaml compiler [1] or
merlin/spelll [2,3].
</p>

<p>
You can find the library <a href="https://github.com/ifazk/mula/">here</a> and the documentation
<a href="https://ifazk.github.io/mula/mula/index.html">here</a>.
It's not on <code>opam</code> yet, but I have submitted a <a href="https://github.com/ocaml/opam-repository/pull/18895">pull
request</a>.
</p>

<p>
Happy OCamling!
</p>

<p>
References:
</p>
<ol class="org-ol">
<li>Edit distance in the OCaml compiler. <a href="https://github.com/ocaml/ocaml/blob/e5e9c5fed56efdd67601e4dbbaebeb134aee361c/utils/misc.ml#L516">https://github.com/ocaml/ocaml/blob/e5e9c5fed56efdd67601e4dbbaebeb134aee361c/utils/misc.ml#L516</a>.</li>
<li>Edit distance in merlin. <a href="https://github.com/ocaml/merlin/blob/444f6e000f6b7dc58dac44d6ac096fc0e09894cc/src/utils/misc.ml#L527">https://github.com/ocaml/merlin/blob/444f6e000f6b7dc58dac44d6ac096fc0e09894cc/src/utils/misc.ml#L527</a></li>
<li>Edit distance in spelll. <a href="https://github.com/c-cube/spelll/blob/3da1182256ff2507a0be812f945a7fe1a19adf9b/src/Spelll.ml#L26">https://github.com/c-cube/spelll/blob/3da1182256ff2507a0be812f945a7fe1a19adf9b/src/Spelll.ml#L26</a></li>
</ol>
</div>
</div>


<div id="outline-container-orgc0ae380" class="outline-3">
<h3 id="orgc0ae380">Ifaz Kabir then added</h3>
<div class="outline-text-3" id="text-orgc0ae380">
</div>
<div id="outline-container-org59c080d" class="outline-4">
<h4 id="org59c080d">Some details:</h4>
<div class="outline-text-4" id="text-org59c080d">
<p>
I followed the paper by Touzet [1] as much as possible. If you take a look at the code, you'll see a a
lot of +1's for 1-indexing. This was to keep the implementation as close to the paper as possible! (If
you do want to check the implementation against the paper, note that the paper has a typo in Definition 2). For the Demarau-Levenshtein automaton, I adapted Figure 9 from Mitankin's thesis [2]. I'm convinced
that my adaptation works, but my adaptation of Touzet's subsumption relation for Demarau-Levenshtein
might be slightly sub-optimal. If you have question about the adaptation, feel free to ask!
</p>

<p>
<code>mula</code> does not completely replace c-cube's <code>spelll</code> package. In particular I don't support any indexs,
etc. But there are some interesting differences in the automata they use. (<code>w</code> stands for the base word
here)
</p>
<ol class="org-ol">
<li>The <code>spelll</code> package creates the Levenshtein Automaton for a single string/word (LA_w), <code>mula</code> uses Universal Levenshtein Automata (ULA).</li>
<li><code>Spelll</code> computes a DFA from a non-deterministic automaton that uses eplison transitions. ULA do not have epsilon transitions, but for transitions it looks ahead into the base word <code>w</code>. Additionally the NFA's states/transitions are computable on the fly, so there is no need to store the NFA in memory.</li>
<li><code>Spelll</code>'s automata transitions using characters. <code>mula</code> computes a bitvector from an input character to transition from states to states. (Computing the bitvector is where the look ahead comes in).</li>
<li><code>Spelll</code>'s automata return <code>true~/~false</code>, and uses a separate function to calculate edit distances. <code>Mula</code> uses the automaton itself to calculate edit distances, the outputs have type <code>int option</code>. (LA_w can be modified to support this though!)</li>
</ol>

<p>
References:
</p>
<ol class="org-ol">
<li>On the Levenshtein Automaton and the Size of the Neighborhood of a Word. Hélène Touzet <a href="https://hal.archives-ouvertes.fr/hal-01360482/file/LATA2016.pdf">https://hal.archives-ouvertes.fr/hal-01360482/file/LATA2016.pdf</a></li>
<li>Universal Levenstein Automata: Building and Properties. Petar Nikolaev Mitankin. <a href="https://store.fmi.uni-sofia.bg/fmi/logic/theses/mitankin-en.pdf">https://store.fmi.uni-sofia.bg/fmi/logic/theses/mitankin-en.pdf</a></li>
</ol>
</div>
</div>
</div>
</div>




<div id="outline-container-7" class="outline-2">
<h2 id="7">New release of mlcuddidl, the OCaml interface to the CUDD BDD library</h2>
<div class="outline-text-2" id="text-7">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-new-release-of-mlcuddidl-the-ocaml-interface-to-the-cudd-bdd-library/8028/1">https://discuss.ocaml.org/t/ann-new-release-of-mlcuddidl-the-ocaml-interface-to-the-cudd-bdd-library/8028/1</a>
</p>
</div>
