2021.06.22.org
** nberth announced


I'm pleased to write this first release announcement for the
[[https://opam.ocaml.org/packages/mlcuddidl][mlcuddidl]] package.

These bindings to the CUDD BDD library were initially written by Bertrand Jeannet and have been around
as an OPAM package for quite some time now.  The source code is now hosted on
[[https://framagit.org/nberth/mlcuddidl][framagit]].

This release of version 3.0.7 mostly ports the package to OCaml versions ≥ 4.10.
      



* first release of orf: OCaml Random Forests
:PROPERTIES:
:CUSTOM_ID: 8
:END:
Archive: https://discuss.ocaml.org/t/ann-first-release-of-orf-ocaml-random-forests/8034/1

** UnixJunkie announced


I finished implementing a classifier and regressor using Random Forests
(seminal paper: https://link.springer.com/article/10.1023/A:1010933404324):

https://github.com/UnixJunkie/orf

Some caveats:
- this is somewhat slow; especially the classifier (and I don’t know so much how to accelerate it; probably two orders of magnitude slower than sklearn).
- this is not super generic (int IntMap sparse features only; i.e. a sparse vector of integers represents a sample).

The package is now available in opam (opam install orf).

Two interfaces are exposed:

RFC (for classification)
https://github.com/UnixJunkie/orf/blob/master/src/RFC.mli

RFR (for regression)
https://github.com/UnixJunkie/orf/blob/master/src/RFR.mli

The test file shows some usage examples:
https://github.com/UnixJunkie/orf/blob/master/src/test.ml

If you want to help, I tried to flag a few things for the near future:
https://github.com/UnixJunkie/orf/issues

If you use it and if it is useful to you, I would be happy to know.
      



* Old CWN
:PROPERTIES:
:UNNUMBERED: t
:END:

If you happen to miss a CWN, you can [[mailto:alan.schmitt@polytechnique.org][send me a message]] and I'll mail it to you, or go take a look at [[https://alan.petitepomme.net/cwn/][the archive]] or the [[https://alan.petitepomme.net/cwn/cwn.rss][RSS feed of the archives]].

If you also wish to receive it every week by mail, you may subscribe [[http://lists.idyll.org/listinfo/caml-news-weekly/][online]].

#+BEGIN_authorname
[[https://alan.petitepomme.net/][Alan Schmitt]]
#+END_authorname
