2021.06.22.html

<div id="outline-container-org5bec749" class="outline-3">
<h3 id="org5bec749">nberth announced</h3>
<div class="outline-text-3" id="text-org5bec749">
<p>
I'm pleased to write this first release announcement for the
<a href="https://opam.ocaml.org/packages/mlcuddidl">mlcuddidl</a> package.
</p>

<p>
These bindings to the CUDD BDD library were initially written by Bertrand Jeannet and have been around
as an OPAM package for quite some time now.  The source code is now hosted on
<a href="https://framagit.org/nberth/mlcuddidl">framagit</a>.
</p>

<p>
This release of version 3.0.7 mostly ports the package to OCaml versions ≥ 4.10.
</p>
</div>
</div>
</div>




<div id="outline-container-8" class="outline-2">
<h2 id="8">first release of orf: OCaml Random Forests</h2>
<div class="outline-text-2" id="text-8">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-first-release-of-orf-ocaml-random-forests/8034/1">https://discuss.ocaml.org/t/ann-first-release-of-orf-ocaml-random-forests/8034/1</a>
</p>
</div>

<div id="outline-container-org0a7071a" class="outline-3">
<h3 id="org0a7071a">UnixJunkie announced</h3>
<div class="outline-text-3" id="text-org0a7071a">
<p>
I finished implementing a classifier and regressor using Random Forests
(seminal paper: <a href="https://link.springer.com/article/10.1023/A:1010933404324">https://link.springer.com/article/10.1023/A:1010933404324</a>):
</p>

<p>
<a href="https://github.com/UnixJunkie/orf">https://github.com/UnixJunkie/orf</a>
</p>

<p>
Some caveats:
</p>
<ul class="org-ul">
<li>this is somewhat slow; especially the classifier (and I don’t know so much how to accelerate it; probably two orders of magnitude slower than sklearn).</li>
<li>this is not super generic (int IntMap sparse features only; i.e. a sparse vector of integers represents a sample).</li>
</ul>

<p>
The package is now available in opam (opam install orf).
</p>

<p>
Two interfaces are exposed:
</p>

<p>
RFC (for classification)
<a href="https://github.com/UnixJunkie/orf/blob/master/src/RFC.mli">https://github.com/UnixJunkie/orf/blob/master/src/RFC.mli</a>
</p>

<p>
RFR (for regression)
<a href="https://github.com/UnixJunkie/orf/blob/master/src/RFR.mli">https://github.com/UnixJunkie/orf/blob/master/src/RFR.mli</a>
</p>

<p>
The test file shows some usage examples:
<a href="https://github.com/UnixJunkie/orf/blob/master/src/test.ml">https://github.com/UnixJunkie/orf/blob/master/src/test.ml</a>
</p>

<p>
If you want to help, I tried to flag a few things for the near future:
<a href="https://github.com/UnixJunkie/orf/issues">https://github.com/UnixJunkie/orf/issues</a>
</p>

<p>
If you use it and if it is useful to you, I would be happy to know.
</p>
</div>
</div>
</div>




<div id="outline-container-org4ca673b" class="outline-2">
<h2 id="org4ca673b">Old CWN</h2>
<div class="outline-text-2" id="text-org4ca673b">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="https://alan.petitepomme.net/cwn/">the archive</a> or the <a href="https://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname" id="org7680337">
<p>
<a href="https://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
